/*********************************************************************************************
* 文件：BH1750.h
* 作者：zonesion
* 说明：BH1750头文件
* 修改：Chenkm 2017.01.10 修改代码格式，增加代码注释和文件说明
* 注释：
*********************************************************************************************/
#ifndef __BH1750_H__
#define __BH1750_H__

#include "stm32f10x.h"
/*********************************************************************************************
* 宏定义
*********************************************************************************************/
//#define uint                    unsigned int 
//#define uchar                   unsigned char
#define DPOWR                   0X00                            //断电  不重复
#define POWERR                   0X01                            //上电        POWER重复
#define RESETT                   0X07                            //重置     RESET重复
#define CHMODE                  0X10                            //连续H分辨率   不重复
#define CHMODE2                 0X11                            //连续H分辨率2  不重复
#define CLMODE                  0X13                            //连续低分辨    不重复
#define H1MODE                  0X20                            //一次H分辨率   不重复
#define H1MODE2                 0X21                            //一次H分辨率2  不重复
#define L1MODE                  0X23                            //一次L分辨率模式  不重复
#define	SlaveAddress            0xA6 //0x46                            //定义器件在IIC总线中的从地址,根据ALT  ADDRESS地址引脚不同修改       不重复
//ALT  ADDRESS引脚接地时地址为0xA6，接电源时地址为0x3A

/*********************************************************************************************
* 内部原型函数
*********************************************************************************************/
u8 bh1750_send_byte(u8 sla,u8 c);
u8 bh1750_read_nbyte(u8 sla,u8 *s,u8 no);
void bh1750_init(void);                                         //初始
float bh1750_get_data(void);

#endif //__BH1750_H__

